Revit 2024 API
AXMImportOptions.ImportLevels Property
 Indicate if levels are to be imported. False by default.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022.1
Syntax
C#
public bool ImportLevels { get; set; }
Visual Basic
Public Property ImportLevels As Boolean
	Get
	Set
Visual C++
public:
property bool ImportLevels {
	bool get ();
	void set (bool value);
}
See Also
AXMImportOptions Class
Autodesk.Revit.DB Namespace